# GROUP ACTIVITY

In this activity, there all 12 questions prepared with varying levels of difficulty. Your task is to answer as many as you can AS A GROUP. Each question is independent of one another. Delegate and strategize on how you will answer the most number of questions. **Good luck! :)**

#### First, setup the data

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [7]:
schools = pd.read_csv("schools_combined.csv")

C:\Users\taba\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (10,11) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [8]:
schools.head()

,Unnamed: 0,region,province,municipality,division,school_id,school_name,year_level,gender,enrollment,latitude,longitude,ID,Total_Enro,Total_Inst,Rooms_used,Rooms_unused,Type_of_Sc
0,0,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 1,male,41,18.25096389,120.6089583,100002,318,16,12.0,0.0,School with no Annexes
1,1,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 1,female,30,18.25096389,120.6089583,100002,318,16,12.0,0.0,School with no Annexes
2,2,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 2,male,37,18.25096389,120.6089583,100002,318,16,12.0,0.0,School with no Annexes
3,3,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 2,female,38,18.25096389,120.6089583,100002,318,16,12.0,0.0,School with no Annexes
4,4,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 3,male,41,18.25096389,120.6089583,100002,318,16,12.0,0.0,School with no Annexes

#### Before proceeding with the questions, check first with your groupmates if you all have the correct dataframe.

1. What is the size of the dataframe?

In [4]:
schools.shape

(159744, 18)

2. What are the columns?

In [5]:
schools.columns

Index(['Unnamed: 0', 'region', 'province', 'municipality', 'division',
       'school_id', 'school_name', 'year_level', 'gender', 'enrollment',
       'latitude', 'longitude', 'ID', 'Total_Enro', 'Total_Inst', 'Rooms_used',
       'Rooms_unused', 'Type_of_Sc'],
      dtype='object')

3. How many schools are there?

In [6]:
schools.school_id.nunique()
#unique number of school id

14003

4. How many missing values are there?

In [6]:
schools.isna().sum()

Unnamed: 0       0
region           0
province         0
municipality     0
division         0
school_id        0
school_name      0
year_level       0
gender           0
enrollment       0
latitude         0
longitude        0
ID               0
Total_Enro       0
Total_Inst       0
Rooms_used      12
Rooms_unused    12
Type_of_Sc       0
dtype: int64

Alright! Get started!

## Exercise

***Easy***

1. Which has a greater number of overall enrollees: males or females? (use `enrollment` column)

Insert markdown final answer:

In [11]:
#Insert code here
schools.groupby(["gender"])["enrollment"].sum()

gender
female    3870769
male      4053979
Name: enrollment, dtype: int64

In [7]:
schools.columns

Index(['Unnamed: 0', 'region', 'province', 'municipality', 'division',
       'school_id', 'school_name', 'year_level', 'gender', 'enrollment',
       'latitude', 'longitude', 'ID', 'Total_Enro', 'Total_Inst', 'Rooms_used',
       'Rooms_unused', 'Type_of_Sc'],
      dtype='object')

2. How many municiapalities are covered by the dataframe?

Insert markdown final answer:

In [20]:
#Insert code here

schools["municipality"].nunique()

996

3. Which year_level has the highest number of enrollees? (use `enrollment` column)

Insert markdown final answer:

In [31]:
#Insert code here
schools.groupby(["year_level"])[["enrollment"]].sum().sort_values(by="enrollment", ascending = False).head(1)

            enrollment
year_level
grade 4         920665

4. Are the school_id equal to school_name? What is the discrepancy?

Insert markdown final answer:

In [35]:
#Insert code here
schools["school_id"].value_counts()

125745    24
120025    24
111304    24
120024    24
120265    24
          ..
305315     8
303266     8
300967     8
300711     8
301075     8
Name: school_id, Length: 14003, dtype: int64

In [32]:
schools.columns

Index(['Unnamed: 0', 'region', 'province', 'municipality', 'division',
       'school_id', 'school_name', 'year_level', 'gender', 'enrollment',
       'latitude', 'longitude', 'ID', 'Total_Enro', 'Total_Inst', 'Rooms_used',
       'Rooms_unused', 'Type_of_Sc'],
      dtype='object')

In [36]:
schools["school_id"].nunique()

14003

In [37]:
schools["school_name"].value_counts()

San Isidro ES                    600
San Vicente ES                   492
San Jose ES                      468
San Roque ES                     384
San Isidro Elementary School     348
                                ...
Barahan NHS                        8
Puerto National High School        8
Cordova National High Sschool      8
Isidoro Salma MHS (Balayong )      8
Paraoir NHS                        8
Name: school_name, Length: 12015, dtype: int64

In [38]:
schools["school_name"].nunique()

12015

In [39]:
schools["school_name"].nunique()== schools["school_id"].nunique()

False

In [41]:
schools["school_id"].nunique()-schools["school_name"].nunique()

1988

5. How many teachers are there overall?

Insert markdown final answer:

In [9]:
#Insert code here
schools['Total_Inst'].value_counts()

6      18892
7      13632
3      11104
8       9984
4       9460
       ...
87         8
76         8
169        8
125        8
127        8
Name: Total_Inst, Length: 128, dtype: int64

In [10]:
schools['Total_Inst'].nunique()

128

In [16]:
schools.groupby('school_id')[['Total_Inst']].first().sum()

Total_Inst    179044
dtype: int64

***Medium***

6. Which province has the highest count of schools? How many is it?

Insert markdown final answer:

In [31]:
#Insert code here
schools.groupby('province')[['school_id']].nunique().sort_values(by = 'school_id').tail(1)

          school_id
province
Leyte          1241

In [17]:
schools.columns

Index(['Unnamed: 0', 'region', 'province', 'municipality', 'division',
       'school_id', 'school_name', 'year_level', 'gender', 'enrollment',
       'latitude', 'longitude', 'ID', 'Total_Enro', 'Total_Inst', 'Rooms_used',
       'Rooms_unused', 'Type_of_Sc'],
      dtype='object')

7. How many provinces only has one school? Which provinces are these?

Insert markdown final answer:

In [39]:
#Insert code here
one_school = schools.groupby('province')[['school_id']].nunique().sort_values(by = 'school_id').head(6)
one_school

                     school_id
province
Abra                         1
Zamboanga Del Norte          1
Sulu                         1
Apayao                       1
Quirino                      1
Mountain Province            1

In [38]:
one_school[one_school['school_id']==1].value_counts()

school_id
1            6
dtype: int64

8. How many municipalities are there in ARMM?

Insert markdown final answer:

In [15]:
#Insert code here
schools[schools['region'] == 'ARMM - Autonomous Region in Muslim Mindanao']\
                            ['municipality'].value_counts().shape[0]

In [64]:
schools[schools['region']=="ARMM - Autonomous Region in Muslim Mindanao"]['municipality'].value_counts().shape[0]

23

In [69]:
schools.groupby('region')[['municipality']].nunique().head(1)

                                             municipality
region
ARMM - Autonomous Region in Muslim Mindanao            23

In [41]:
schools.columns

Index(['Unnamed: 0', 'region', 'province', 'municipality', 'division',
       'school_id', 'school_name', 'year_level', 'gender', 'enrollment',
       'latitude', 'longitude', 'ID', 'Total_Enro', 'Total_Inst', 'Rooms_used',
       'Rooms_unused', 'Type_of_Sc'],
      dtype='object')

In [46]:
schools.groupby('region')['municipality'].value_counts()

region                                       municipality
ARMM - Autonomous Region in Muslim Mindanao  City Of Lamitan     76
                                             Tipo-Tipo           32
                                             Balindong (Watu)    24
                                             Piagapo             24
                                             Saguiaran           24
                                                                 ..
Region XII - Soccsksargen                    Kalamansig           8
                                             Lebak                8
                                             Maasim               8
                                             Palimbang            8
                                             Polomolok            8
Name: municipality, Length: 1129, dtype: int64

9. Which school has the most number of rooms (used + unused)?

Insert markdown final answer:

In [75]:
#Insert code here
schools.groupby('school_name')['tot_rooms']

In [70]:
schools.columns

Index(['Unnamed: 0', 'region', 'province', 'municipality', 'division',
       'school_id', 'school_name', 'year_level', 'gender', 'enrollment',
       'latitude', 'longitude', 'ID', 'Total_Enro', 'Total_Inst', 'Rooms_used',
       'Rooms_unused', 'Type_of_Sc'],
      dtype='object')

In [74]:
schools['tot_rooms'] = schools['Rooms_used'] + schools['Rooms_unused']
schools['tot_rooms']

In [87]:
schools.groupby('school_id')[['tot_rooms']].first().sort_values(by = 'tot_rooms',ascending = False).head(1)

           tot_rooms
school_id
305413         187.0

10. Within the schools in Central Visayas, how many female enrollees do they have all in all? (use `enrollment` column)

Insert markdown final answer:

In [101]:
#Insert code here
regVII_female = schools[(schools['region']=='Region VII - Central Visayas') & (schools['gender'] == 'female')]
regVII_female

,Unnamed: 0,region,province,municipality,division,school_id,school_name,year_level,gender,enrollment,latitude,longitude,ID,Total_Enro,Total_Inst,Rooms_used,Rooms_unused,Type_of_Sc,tot_rooms
71065,71065,Region VII - Central Visayas,Bohol,Alburquerque,Bohol,117930,Bahi Primary School,grade 1,female,5,9.61231,123.944,117930,64,2,2.0,0.0,School with no Annexes,2.0
71067,71067,Region VII - Central Visayas,Bohol,Alburquerque,Bohol,117930,Bahi Primary School,grade 2,female,10,9.61231,123.944,117930,64,2,2.0,0.0,School with no Annexes,2.0
71069,71069,Region VII - Central Visayas,Bohol,Alburquerque,Bohol,117930,Bahi Primary School,grade 3,female,8,9.61231,123.944,117930,64,2,2.0,0.0,School with no Annexes,2.0
71071,71071,Region VII - Central Visayas,Bohol,Alburquerque,Bohol,117930,Bahi Primary School,grade 4,female,7,9.61231,123.944,117930,64,2,2.0,0.0,School with no Annexes,2.0
71073,71073,Region VII - Central Visayas,Bohol,Alburquerque,Bohol,117930,Bahi Primary School,grade 5,female,0,9.61231,123.944,117930,64,2,2.0,0.0,School with no Annexes,2.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
150255,150255,Region VII - Central Visayas,Negros Oriental,Valencia (Luzurriaga),Negros Oriental,303291,Valencia National High School (Valencia Tech. ...,fourth year,female,137,9.278714,123.248878,303291,1089,31,22.0,0.0,Mother school,22.0
150257,150257,Region VII - Central Visayas,Negros Oriental,Vallehermoso,Negros Oriental,303292,Vallehermoso National High School,first year,female,223,10.330328,123.325979,303292,1367,9,16.0,0.0,Annex or Extension school(s),16.0
150259,150259,Region VII - Central Visayas,Negros Oriental,Vallehermoso,Negros Oriental,303292,Vallehermoso National High School,second year,female,222,10.330328,123.325979,303292,1367,9,16.0,0.0,Annex or Extension school(s),16.0
150261,150261,Region VII - Central Visayas,Negros Oriental,Vallehermoso,Negros Oriental,303292,Vallehermoso National High School,third year,female,167,10.330328,123.325979,303292,1367,9,16.0,0.0,Annex or Extension school(s),16.0
150263,150263,Region VII - Central Visayas,Negros Oriental,Vallehermoso,Negros Oriental,303292,Vallehermoso National High School,fourth year,female,181,10.330328,123.325979,303292,1367,9,16.0,0.0,Annex or Extension school(s),16.0

In [103]:
regVII_female["enrollment"].sum()

222644

In [90]:
schools['region'].value_counts()

Region VIII - Eastern Visayas                  22820
Region VI - Western Visayas                    16760
Region I - Ilocos Region                       16380
Region IV-A - CALABARZON                       13568
Region IX - Zamboanga Peninsula                13300
Region III - Central Luzon                     12564
Region V - Bicol Region                        12300
CARAGA - CARAGA                                11388
Region VII - Central Visayas                   10708
Region XII - SOCCSKSARGEN                       8124
Region XI - Davao Region                        6980
Region IV-B - MIMAROPA                          4668
Region II - Cagayan Valley                      4040
Region X - Northern Mindanao                    2204
NCR - National Capital Region                   1952
Region XII - Soccsksargen                       1256
CAR - Cordillera Administrative Region           368
ARMM - Autonomous Region in Muslim Mindanao      364
Name: region, dtype: int64

***Hard***

11. How many secondary students are there overall? (use `enrollment` column)

Insert markdown final answer:

In [104]:
#Insert code here

In [106]:
schools["year_level"].unique()

array(['grade 1', 'grade 2', 'grade 3', 'grade 4', 'grade 5', 'grade 6',
       'first year', 'second year', 'third year', 'fourth year'],
      dtype=object)

In [118]:
secondary = ['first year', 'second year', 'third year', 'fourth year']
secondary

['first year', 'second year', 'third year', 'fourth year']

In [119]:
schools[schools['year_level'].isin(secondary)]['year_level'].value_counts()

first year     4698
second year    4698
third year     4698
fourth year    4698
Name: year_level, dtype: int64

In [120]:
schools[schools['year_level'].isin(secondary)]['enrollment'].sum()

2918650

12. Which school_id has the highest teacher-student ratio?

In [130]:
schools.groupby('school_id')[['Total_Inst', 'enrollment']]\
.agg({'Total_Inst':'sum','enrollment':'sum'})

           Total_Inst  enrollment
school_id
100002            192         407
100003             72         152
100004             84         107
100005             84          67
100007             84         137
...               ...         ...
321504            104         615
321601            128        2832
322502             48         143
322503             64         130
322601             64         318

[14003 rows x 2 columns]

In [131]:
schools.groupby('school_id')[['Total_Inst', 'enrollment']]\
.agg({'Total_Inst':'first','enrollment':'sum'})

           Total_Inst  enrollment
school_id
100002             16         407
100003              6         152
100004              7         107
100005              7          67
100007              7         137
...               ...         ...
321504             13         615
321601             16        2832
322502              6         143
322503              8         130
322601              8         318

[14003 rows x 2 columns]

In [132]:
new_df = schools.groupby('school_id')[['Total_Inst', 'enrollment']]\
.agg({'Total_Inst':'first','enrollment':'sum'})

In [135]:
new_df['ratio'] = new_df['Total_Inst']/new_df['enrollment']
new_df[['ratio']]

              ratio
school_id
100002     0.039312
100003     0.039474
100004     0.065421
100005     0.104478
100007     0.051095
...             ...
321504     0.021138
321601     0.005650
322502     0.041958
322503     0.061538
322601     0.025157

[14003 rows x 1 columns]

In [136]:
new_df.sort_values(by='ratio', ascending= False)

           Total_Inst  enrollment     ratio
school_id
121426              2           4  0.500000
300193             54         137  0.394161
319603             84         241  0.348548
121793              2           7  0.285714
131795              3          11  0.272727
...               ...         ...       ...
316637              0          82  0.000000
103148              0         489  0.000000
120266              0         104  0.000000
120603              0         120  0.000000
125270              0         866  0.000000

[14003 rows x 3 columns]

Insert markdown final answer:

In [19]:
#Insert code here